## Creating pandas DataFrames

In [ ]:
# Import pandas library
import pandas as pd

In [3]:
# Create empty DataFrame
df = pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [4]:
# Header of dataframe
df.head()

Empty DataFrame
Columns: []
Index: []

In [53]:
# Create dictionary of list
data=?

In [35]:
data

{'Name': ['Vijay', 'Sundar', 'Satyam', 'Indira'], 'Age': [23, 45, 46, 52]}

In [36]:
# Create the pandas DataFrame
df =?

In [37]:
# Header of dataframe
df.head()

     Name  Age
0   Vijay   23
1  Sundar   45
2  Satyam   46
3  Indira   52

In [54]:
# Pandas DataFrame by lists of dicts.
# Initialise data to lists.
data1 =?

In [57]:
data1

[{'Name': 'Vijay', 'Age': 23},
 {'Name': 'Sundar', 'Age': 25},
 {'Name': 'Shankar', 'Age': 26}]

In [39]:
# Creates DataFrame.
df1 = ?

In [41]:
# Print dataframe header

     Name  Age
0   Vijay   23
1  Sundar   45
2  Satyam   46
3  Indira   52

In [58]:
# Creating DataFrame using list of tuples.
data2 = ?

In [59]:
data2

[('Vijay', 23), ('Sundar', 45), ('Satyam', 46), ('Indira', 52)]

In [43]:
# Create dataframe
df2 = ?

In [44]:
# Print dataframe header

     Name  Age
0   Vijay   23
1  Sundar   45
2  Satyam   46
3  Indira   52

## Understanding pandas Series

In [67]:
# Creating Pandas Series using Dictionary
dict1

In [68]:
dict1

{0: 'Ajay', 1: 'Jay', 2: 'Vijay'}

In [69]:
# Create Pandas Series

In [47]:
# Show series
series

0     Ajay
1      Jay
2    Vijay
dtype: object

# Using a NumPy array: Create a NumPy array object and pass it to the Series object

In [48]:
#Load Pandas and NumPy libraries
import pandas as pd
import numpy as np

In [61]:
# Create NumPy array
arr = ?

In [63]:
arr

array([51, 65, 48, 59, 68])

In [50]:
# Create Pandas Series
series =?

0    51
1    65
2    48
3    59
4    68
dtype: int32

In [64]:
series

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

## Using a single scalar value: To create a pandas Series with a scalar value, pass the scalar value and index list to a Series object

In [65]:
# load Pandas and NumPy
import pandas as pd
import numpy as np

In [52]:
# Create Pandas Series
series = ?

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [66]:
series

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64